autosportlabs/RaceCapture-Pro_firmware/src/drivers/esp8266_drv.c
/*
 * Race Capture Firmware
 *
 * Copyright (C) 2016 Autosport Labs
 *
 * This file is part of the Race Capture firmware suite
 *
 * This is free software: you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This software is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 *
 * See the GNU General Public License for more details. You should
 * have received a copy of the GNU General Public License along with
 * this code. If not, see <http://www.gnu.org/licenses/>.
 */

#include "FreeRTOS.h"
#include "at_basic.h"
#include "capabilities.h"
#include "constants.h"
#include "dateTime.h"
#include "esp8266.h"
#include "esp8266_drv.h"
#include "net/ipv4.h"
#include "macros.h"
#include "led.h"
#include "loggerConfig.h"
#include "panic.h"
#include "printk.h"
#include "queue.h"
#include "semphr.h"
#include "str_util.h"
#include "task.h"
#include "taskUtil.h"
#include "timers.h"
#include "wifi.h"
#include "wifi_device.h"
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>

#define AP_BACKOFF_MS		30000
#define AT_TASK_TIMEOUT_MS	3
#define CHECK_DONE_SLEEP_MS	3600000
#define CLIENT_BACKOFF_MS	3000
#define INIT_FAIL_SLEEP_MS	10000
#define LED_PERIOD_MS		25
#define LOG_PFX			"[ESP8266 Driver] "
#define MAX_CHANNELS		5
#define RX_DATA_TIMEOUT_TICKS	1
#define SERIAL_BUFF_DEF_RX_SIZE	RX_MAX_MSG_LEN
#define SERIAL_BUFF_DEF_TX_SIZE	256
#define SERIAL_CMD_MAX_LEN	(RX_MAX_MSG_LEN + 16)
#define TASK_STACK_SIZE		256
#define TASK_THREAD_NAME	"ESP8266 Driver"

enum init_state {
        INIT_STATE_UNINITIALIZED = 0,
        INIT_STATE_READY,
        INIT_STATE_FAILED,
        INIT_STATE_RESET,
        INIT_STATE_RESET_HARD,
};

struct device {
        struct Serial *serial;
        enum init_state init_state;
        enum esp8266_op_mode op_mode;
};

struct client {
        const struct wifi_client_cfg *config;
        struct esp8266_client_info info;
        struct esp8266_ipv4_info ipv4;
        tiny_millis_t info_timestamp;
        tiny_millis_t next_join_attempt;
};

struct ap {
        const struct wifi_ap_cfg *config;
        struct esp8266_ap_info info;
        struct esp8266_ipv4_info ipv4;
        tiny_millis_t info_timestamp;
        tiny_millis_t next_set_attempt;
};

struct server {
        bool listening;
};

struct channel {
        struct Serial *serial;
};

struct channel_sync_op {
        xSemaphoreHandle op_semaphore;
        xSemaphoreHandle cb_semaphore;
        size_t chan_id;
};

struct comm {
        new_conn_func_t *new_conn_cb;
        struct channel channels[MAX_CHANNELS];
        struct channel_sync_op connect_op;
        struct channel_sync_op close_op;
};

/**
 * These enums define the various checks that we can perform.
 * Checks can lead to action.  Actions lead to updated state,
 * which can then trigger checks.  We go round and round with
 * this methodology to ensure that all decision making is kept
 * in a single location.  Checks stop when nothing needs to
 * be changed.
 *
 * Note that each check represents a tiny state machine.  These
 * state machines have interdependeinces upon one another. In
 * example the client wifi (CHECK_WIFI_CLIENT) requires that the wifi
 * subsystem (CHECK_WIFI_DEVICE) be initialized. Thus we need a priority
 * with the lowest value being the highest priority.
 */
enum check {
        CHECK_WIFI_DEVICE,
        CHECK_WIFI_CLIENT,
        CHECK_WIFI_AP,
        CHECK_SERVER,
        CHECK_DATA,
        __NUM_CHECKS, /* Always the last */
};

struct cmd {
        bool in_progress;
        tiny_millis_t check[__NUM_CHECKS];
};

static struct {
        struct device device;
        struct client client;
        struct ap ap;
        struct server server;
        struct comm comm;
        struct cmd cmd;
        struct {
                tiny_millis_t backoff;
                xTimerHandle timer;
        } led;
} esp8266_state;

static void led_timer_cb( xTimerHandle xTimer )
{
        led_set(LED_WIFI, false);
}

static void trigger_led()
{
        const tiny_millis_t now = getUptime();

        /* Backoff until backoff is expired */
        if (esp8266_state.led.timer && now < esp8266_state.led.backoff)
                return;

        /* If here, set the light, and set the timer to turn it off */
        esp8266_state.led.backoff = now + msToTicks(LED_PERIOD_MS) * 2;
        xTimerStart(esp8266_state.led.timer, 0);
        led_set(LED_WIFI, true);
}


static void cmd_started()
{
        esp8266_state.cmd.in_progress = true;
}

static void cmd_completed()
{
        trigger_led();
        esp8266_state.cmd.in_progress = false;
}

static void cmd_sleep_until(enum check check,
                            const tiny_millis_t time)
{
        esp8266_state.cmd.check[check] = time;
}

static void cmd_sleep(enum check check,
                      const tiny_millis_t sleep_ms)
{
        cmd_sleep_until(check,
                        date_time_uptime_now_plus(sleep_ms));
}

static void cmd_set_check(enum check check)
{
        esp8266_state.cmd.check[check] = 0;
}

/**
 * Returns the next check we need to perform in order of priority.
 * The lower the value, the higher the priority.
 */
static enum check cmd_get_next_check()
{
        for(size_t i = 0; i < __NUM_CHECKS; ++i)
                if (date_time_is_past(esp8266_state.cmd.check[i]))
                        return i;

        return -1;
}

static void cmd_check_complete(enum check check)
{
        esp8266_state.cmd.check[check] =
                date_time_uptime_now_plus(CHECK_DONE_SLEEP_MS);
}

/**
 * Checks if we are ready to execute a command.
 */
static bool cmd_ready() {
        return !esp8266_state.cmd.in_progress;
}

/* Begin code for sending/receiving data using our internal channels */

static bool channel_is_valid_id(const size_t chan_id)
{
        return chan_id < ARRAY_LEN(esp8266_state.comm.channels);
}

