autosportlabs/RaceCapture-Pro_firmware/src/drivers/esp8266_drv.c
static bool channel_is_open(struct channel* ch)
{
	return !!ch->serial;
}

/**
 * Called when we close a channel.
 */
static void channel_close(struct channel* ch)
{
	if (!ch->serial)
		return;

	serial_close(ch->serial);
	ch->serial = NULL;
}

static const char* channel_get_name(const size_t chan_id)
{
        static const char* _serial_names[] = {
                "Wifi Chan 0",
                "Wifi Chan 1",
                "Wifi Chan 2",
                "Wifi Chan 3",
                "Wifi Chan 4",
        };

        if (chan_id >= ARRAY_LEN(_serial_names))
                return NULL;

        return _serial_names[chan_id];
}

static void _tx_char_cb(xQueueHandle queue, void *post_tx_arg)
{
        cmd_set_check(CHECK_DATA);
}

/**
 * Sets up a channel by allocating a channel and then creating a Serial
 * device that backs it.
 * @param index Channel ID/index.
 * @param rx_size Size of the Rx Buffer
 * @param tx_size Size of the Tx Buffer
 * @param pointer to the channel structure that was setup, NULL if failure.
 */
static struct channel* channel_setup(const unsigned int index,
				     size_t rx_size, size_t tx_size)
{
        if (!channel_is_valid_id(index))
                return NULL;

        struct channel* ch = esp8266_state.comm.channels + index;
        if (ch->serial) {
		/* Channel is in use!  Something is wrong */
                pr_warning_int_msg(LOG_PFX "Setup called on allocated "
				   "channel ", index);
		pr_warning(LOG_PFX "Closing stale Serial object");
		channel_close(ch);
	}

	if (0 == rx_size)
		rx_size = SERIAL_BUFF_DEF_RX_SIZE;

	if (0 == tx_size)
		tx_size = SERIAL_BUFF_DEF_TX_SIZE;

	const char* name = channel_get_name(index);
        struct Serial *s = serial_create(name, tx_size, rx_size, NULL,
					 NULL, _tx_char_cb, ch);

	if (!s) {
		/* Fail state */
		pr_warning(LOG_PFX "Insufficient resources for new "
			   "Serial\r\n");
		return NULL;
	}

        ch->serial = s;
        return ch;
}

static int channel_find_serial(struct Serial *serial)
{
        for (size_t i = 0; channel_is_valid_id(i); ++i) {
                struct channel *ch = esp8266_state.comm.channels + i;
                if (serial == ch->serial)
                        return i;
        }

        return -1;
}

static int channel_get_next_available()
{
	return channel_find_serial(NULL);
}


/**
 * Callback that gets invoked when a socket state changes.
 */
static void socket_state_changed_cb(const size_t chan_id,
                                    const enum socket_action action)
{
        if (!channel_is_valid_id(chan_id)) {
                pr_warning_int_msg(LOG_PFX "Invalid socket id: ",
                                   chan_id);
                return;
        }

        struct channel *ch = esp8266_state.comm.channels + chan_id;
        switch (action) {
        case SOCKET_ACTION_DISCONNECT:
                pr_info_int_msg(LOG_PFX "Socket closed on channel ",
                                chan_id);
		channel_close(ch);
                break;
        case SOCKET_ACTION_CONNECT:
                pr_info_int_msg(LOG_PFX "Socket connected on channel ",
                                chan_id);

		/* Use Defaults for rx and tx buff sizes */
		if (!channel_setup(chan_id, 0, 0)) {
			/* Close the channel.  Best effort here. */
			esp8266_close(chan_id, NULL);
			break;
		}

		if (esp8266_state.comm.new_conn_cb) {
			esp8266_state.comm.new_conn_cb(ch->serial);
		} else {
			pr_warning(LOG_PFX "No incoming server callback "
				   "defined. Data \r\n");
		}
                break;
        default:
                pr_warning(LOG_PFX "Unknown socket action\r\n");
                break;
        }

        cmd_set_check(CHECK_DATA);
}

/**
 * Callback that gets invoked by the device code whenever new data
 * comes in.
 */
static void rx_data_cb(int chan_id, size_t len, const char* data)
{
        trigger_led();
        pr_trace_str_msg(LOG_PFX "Rx: ", data);

        if (!channel_is_valid_id(chan_id)) {
                pr_error_int_msg(LOG_PFX "Invalid Channel ID: ", chan_id);
                return;
        }

	/*
	 * Check that we have a backing serial device before we read in
	 * the data. If none, gotta dump it.
	 */
	struct channel *ch = esp8266_state.comm.channels + chan_id;
	if (!channel_is_open(ch)) {
		pr_error(LOG_PFX "Channel has no backing serial device. "
			 "Dropping data\r\n");
		return;
	}

        xQueueHandle q = serial_get_rx_queue(ch->serial);
        bool data_dropped = false;
        for (size_t i = 0; i < len && !data_dropped; ++i)
                if (!xQueueSend(q, data + i, RX_DATA_TIMEOUT_TICKS))
                        data_dropped = true;

        if (data_dropped)
                pr_warning(LOG_PFX "Rx Buffer Overflow Detected\r\n");

        cmd_set_check(CHECK_DATA);
}

/**
 * Callback that is invoked when the send_data method completes.
 */
static void _send_data_cb(const bool status, const size_t bytes,
			  const int chan)
{
	cmd_completed();
	cmd_set_check(CHECK_DATA);

	if (!status) {
		pr_warning_int_msg(LOG_PFX "Failed to send data on "
				   "channel ", chan);

		/*
		 * Hack: Close channel when error b/c we have lost data.
		 * Issue #807
		 */
		struct channel *ch = esp8266_state.comm.channels + chan;
		channel_close(ch);

		return;
	}
}

/**
 * Method that processes outgoing data if any.	If there is, this
 * will start a command.
 */
static void check_data()
{
	cmd_check_complete(CHECK_DATA);

	for (size_t i = 0; i < ARRAY_LEN(esp8266_state.comm.channels); ++i) {
		struct channel *ch = esp8266_state.comm.channels + i;
		struct Serial* serial = ch->serial;

		/*
		 * Check if connection is still active.	 If not then
		 * there is nothing for us to do.
		 */
		if (!serial || !serial_is_connected(serial))
			continue;

		/* If the size is 0, nothing to send */
		xQueueHandle q = serial_get_tx_queue(ch->serial);
		const size_t size = uxQueueMessagesWaiting(q);
		if (0 == size)
			continue;

		/* If here, we have a connection and data to send. Do Eet! */
		if (!esp8266_send_data(i, serial, size, _send_data_cb)) {
			pr_warning(LOG_PFX "Failed to queue send "
				   "data command!!!\r\n");
			/* We will retry */
			return;
		}

