autosportlabs/RaceCapture-Pro_firmware/src/drivers/esp8266_drv.c
		cmd_started();
		return;
	}
}

/**
 * Callback that gets invoked when our client wifi state changes.
 */
static void client_state_changed_cb(const char* msg)
{
        /* Need to check our client now that a change has occured */
        cmd_set_check(CHECK_WIFI_CLIENT);

        memset(&esp8266_state.client.info, 0,
               sizeof(esp8266_state.client.info));
        memset(&esp8266_state.client.ipv4, 0,
               sizeof(esp8266_state.client.ipv4));

        pr_info_str_msg(LOG_PFX "Client state changed: ", msg);
}

/* *** Methods that handle device init and reset *** */

/**
 * Callback that is invoked when the init_wifi command completes.
 */
static void init_wifi_cb(const bool status)
{
        cmd_completed();
        cmd_set_check(CHECK_WIFI_DEVICE);

        if (!status) {
                /* Then failed to init wifi */
                pr_warning(LOG_PFX "Initialization failed\r\n");
                esp8266_state.device.init_state = INIT_STATE_FAILED;
                return;
        }

        pr_info(LOG_PFX "Initialization successful\r\n");

	/*
	 * Clear out the timestamps and set the checks on all the
	 * subsystems since they will all change after an init.
	 */
	esp8266_state.client.info_timestamp = 0;
	esp8266_state.ap.info_timestamp = 0;
        esp8266_state.device.init_state = INIT_STATE_READY;

        /* Now that init state has changed, check them */
        cmd_set_check(CHECK_WIFI_DEVICE);
        cmd_set_check(CHECK_WIFI_CLIENT);
        cmd_set_check(CHECK_WIFI_AP);
        cmd_set_check(CHECK_SERVER);
        cmd_set_check(CHECK_DATA);
}

/**
 * Use this to initialize the WiFi device.  Device should be in a reset state.
 * If not, this may fail.
 */
static void init_wifi()
{
        pr_info(LOG_PFX "Initializing Wifi\r\n");

        serial_clear(esp8266_state.device.serial);
        if (!esp8266_init(init_wifi_cb)) {
                /* Failed to init critical bits.  */
                pr_warning(LOG_PFX "Failed to init esp8266 device.\r\n");
                cmd_sleep(CHECK_WIFI_DEVICE, INIT_FAIL_SLEEP_MS);
                esp8266_state.device.init_state = INIT_STATE_FAILED;
                return;
        }

        cmd_started();

        /*
         * Now register the callback for incoming data.  Safe to do
         * before init has completed b/c this invokes no modem calls.
         * This should only fail if there was an issue with space or config.
         */
        const struct esp8266_event_hooks hooks = {
                .client_state_changed_cb = client_state_changed_cb,
                .socket_state_changed_cb = socket_state_changed_cb,
                .data_received_cb = rx_data_cb,
        };

        if (!esp8266_register_callbacks(&hooks))
                pr_warning(LOG_PFX "Failed to register callbacks\r\n");
}

/**
 * Callback used by the get_op_mode call.
 */
static void get_op_mode_cb(bool status, enum esp8266_op_mode mode)
{
        cmd_completed();
        cmd_set_check(CHECK_WIFI_DEVICE);

        if (!status) {
                pr_warning(LOG_PFX "Get OP mode failed!\r\n");
                esp8266_state.device.op_mode = ESP8266_OP_MODE_UNKNOWN;
        } else {
                esp8266_state.device.op_mode = mode;
        }
}

/**
 * Command that gets the wifi device operational mode.  This can be
 * client, soft_ap, or both.
 */
static void get_op_mode()
{
        if (!esp8266_get_op_mode(get_op_mode_cb)) {
                pr_warning(LOG_PFX "Failed to get OP mode\r\n");
                return;
        }

        cmd_started();
}

/**
 * Callback used by the set_op_mode call.
 */
static void set_op_mode_cb(const bool status)
{
        cmd_completed();
        cmd_set_check(CHECK_WIFI_DEVICE);

        /*
         * Clear out our state and read from device again to ensure that
         * the value actually took
         */
        esp8266_state.device.op_mode = ESP8266_OP_MODE_UNKNOWN;

        if (!status)
                pr_warning(LOG_PFX "Set OP mode failed!\r\n");
}

/**
 * Command that sets the wifi device operational mode. Useful for changing
 * between modes after actions like a user changing the config.
 */
static void set_op_mode(const enum esp8266_op_mode mode)
{
        if (!esp8266_set_op_mode(mode, set_op_mode_cb)) {
                pr_warning(LOG_PFX "Failed to invoke set OP mode\r\n");
                return;
        }

        cmd_started();
}

static void set_fast_baud_cb(const bool status)
{
	cmd_completed();
	cmd_set_check(CHECK_WIFI_DEVICE);

	if (!status) {
		pr_warning(LOG_PFX "Set uart mode failed!\r\n");
		return;
	}

	serial_config(esp8266_state.device.serial, ESP8266_SERIAL_DEF_BITS,
		      ESP8266_SERIAL_DEF_PARITY, ESP8266_SERIAL_DEF_STOP,
		      WIFI_MAX_BAUD);
	serial_clear(esp8266_state.device.serial);
}

static void set_fast_baud()
{
	pr_info_int_msg(LOG_PFX "Increasing baud to ", WIFI_MAX_BAUD);

	if (!esp8266_set_uart_config(WIFI_MAX_BAUD, ESP8266_SERIAL_DEF_BITS,
				     ESP8266_SERIAL_DEF_PARITY,
				     ESP8266_SERIAL_DEF_STOP,
				     set_fast_baud_cb)) {
		pr_warning(LOG_PFX "Failed to invoke set_uart_config\r\n");
		return;
	}

	cmd_started();
}

/**
 * Method that checks the device state.	 Handles all aspects including
 * initialization, reset, mode, and whatever else may need handling
 * down the road.
 */
static void check_wifi_device()
{
	cmd_check_complete(CHECK_WIFI_DEVICE);
	pr_info(LOG_PFX "Checking WiFi Device...\r\n");

	switch(esp8266_state.device.init_state) {
	case INIT_STATE_FAILED:
		delayMs(CLIENT_BACKOFF_MS);
		/* Fall into hard reset */
	case INIT_STATE_RESET_HARD:
		wifi_device_reset();
	case INIT_STATE_RESET:
	case INIT_STATE_UNINITIALIZED:
		init_wifi();
		return;
	case INIT_STATE_READY:
		/* Then we are where we want to be */
		break;
	}


	/* Check our baud rate and ensure it maxed out */
	const struct serial_cfg* serial_cfg =
		serial_get_config(esp8266_state.device.serial);
	if (serial_cfg->baud != WIFI_MAX_BAUD) {
		set_fast_baud();
		return;
	}


        /* Check if we know our device mode.  If not, get it */
        if (ESP8266_OP_MODE_UNKNOWN == esp8266_state.device.op_mode) {
                /* Get OP mode */
                get_op_mode();
                return;
        }

