autosportlabs/RaceCapture-Pro_firmware/src/drivers/esp8266_drv.c
        /* Now check device mode to ensure its correct */
        enum esp8266_op_mode exp_mode;
        const bool ap_active = esp8266_state.ap.config->active;
        const bool client_active = esp8266_state.client.config->active;
        if (ap_active) {
                /* AP should be active.  Is the client? */
                exp_mode = client_active ?
                        ESP8266_OP_MODE_BOTH : ESP8266_OP_MODE_AP;
        } else {
                /*
                 * AP should be inactive.  We just set client here since
                 * we can't disable both client and AP.  We effectively do
                 * this by simply not having the client associate with any
                 * AP.
                 */
                exp_mode = ESP8266_OP_MODE_CLIENT;
        }

        if (exp_mode != esp8266_state.device.op_mode) {
                /* Then set the correct mode */
                set_op_mode(exp_mode);
                return;
        }

        /* If here, WiFi Device is in the correct state */
        return;
}

static bool device_initialized()
{
        return esp8266_state.device.init_state == INIT_STATE_READY;
}


/* *** Methods that handle the client WiFi state and actions *** */

/**
 * Callback that gets invoked with the get_client_ap command completes.
 */
static void get_client_ap_cb(bool status, const struct esp8266_client_info *ci)
{
        cmd_completed();
        cmd_set_check(CHECK_WIFI_CLIENT);
        esp8266_state.client.info_timestamp = getUptime();

        memcpy(&esp8266_state.client.info, ci, sizeof(struct esp8266_client_info));
}

/**
 * Command that will populate our wifi client info with useful data.
 */
static void get_client_ap()
{
        pr_info(LOG_PFX "Retrieving Wifi Client Info\r\n");
        esp8266_get_client_ap(get_client_ap_cb);
        cmd_started();
}

/**
 * Callback that gets invoked when the get_ip_info call completes.
 */
static void get_ip_info_cb(const bool status,
                           const struct esp8266_ipv4_info* client,
                           const struct esp8266_ipv4_info* station)
{
        cmd_completed();
        cmd_set_check(CHECK_WIFI_CLIENT);
        cmd_set_check(CHECK_WIFI_AP);

        if (!status) {
                pr_info(LOG_PFX "Failed to obtain IP info\r\n");
        }

        /*
         * Update IP information for both station and client.
         * This is sane in the failure case since the driver will
         * return zeroed out objects.
         */
        const size_t size = sizeof(struct esp8266_ipv4_info);
        memcpy(&esp8266_state.client.ipv4, client, size);
        memcpy(&esp8266_state.ap.ipv4, station, size);
}

/**
 * Command that will get the ip information about our system and
 * update both our AP and Client structs with data.
 */
static void get_ip_info()
{
        pr_info(LOG_PFX "Retrieving Wifi IP info\r\n");
        esp8266_get_ip_info(get_ip_info_cb);
        cmd_started();
}

/**
 * Callback that gets invoked upon completion of set_client_ap command.
 */
static void set_client_ap_cb(bool status)
{
        cmd_completed();
        cmd_set_check(CHECK_WIFI_CLIENT);

        if (!status) {
                /* Failed. */
                pr_info(LOG_PFX "Failed to join network\r\n");
        } else {
                /* If here, we were successful. */
                pr_info(LOG_PFX "Successfully joined network\r\n");
        }

        /* Clear the client info since it has changed. */
        esp8266_state.client.info_timestamp = 0;
        memset(&esp8266_state.client.info, 0,
               sizeof(esp8266_state.client.info));
}

/**
 * Command that will set the wifi client settings as specified in
 * our settings.
 */
static void set_client_ap()
{
        pr_info(LOG_PFX "Setting Wifi Client Info\r\n");
        const struct wifi_client_cfg *cc = esp8266_state.client.config;
        pr_info_str_msg(LOG_PFX "Joining network: ", cc->ssid);
        esp8266_join_ap(cc->ssid, cc->passwd, set_client_ap_cb);
        cmd_started();
}

/**
 * Helper method to check_wifi_client.  This method tries to join an AP, but
 * also handles cases where its not reachable or we have other issues
 * (like an incorrect password).
 */
static void client_try_join_ap()
{
        if (!date_time_is_past(esp8266_state.client.next_join_attempt)){
                /* Then we need to backoff */
                const tiny_millis_t sleep_len =
                        esp8266_state.client.next_join_attempt - getUptime();
                cmd_sleep(CHECK_WIFI_CLIENT, sleep_len);
        } else {
                /* If here, then its time to do work */
                esp8266_state.client.next_join_attempt =
                        date_time_uptime_now_plus(CLIENT_BACKOFF_MS);
                set_client_ap();
        }
}

/**
 * This is the block of logic that manages our WiFi client state.
 * Its responsible for keeping the client status as close to the
 * configuration as is reasonably possible.
 */
static void check_wifi_client()
{
        cmd_check_complete(CHECK_WIFI_CLIENT);

        pr_info(LOG_PFX "Checking Client\r\n");

        /* First check that we are initialized */
        if (!device_initialized()) {
                cmd_sleep(CHECK_WIFI_CLIENT, CLIENT_BACKOFF_MS);
                return;
        }

        /*
         * First check if we have reasonably fresh client info. Have to
         * have it before we can make any decisions.
         */
        if (0 == esp8266_state.client.info_timestamp) {
                get_client_ap();
                return;
        }

        /* If here, we have fresh client info.  Use it to make decisions. */
        const struct wifi_client_cfg *cfg = esp8266_state.client.config;
        const struct esp8266_client_info *ci = &esp8266_state.client.info;
        if (cfg->active) {
                /*
                 * Config says client should be active. Make it so.
                 * First check that we have an AP and that we are on
                 * the correct client network.  If not, try to get on
                 * the correct network.
                 */
                if (!esp8266_drv_client_connected()) {
                        /* Then we need to try and join the AP */
                        client_try_join_ap();
                        return;
                }

                /* If here, then on correct AP.  Do we have IP info? */
                if (!*esp8266_state.client.ipv4.address) {
                        /* Then we need to get IP Information */
                        get_ip_info();
                        return;
                }

                /* If here, we are done */
                pr_info(LOG_PFX "Client configured correctly\r\n");
                pr_info_str_msg(LOG_PFX "Client IP: ",
                        esp8266_state.client.ipv4.address);
                return;
        } else {
                /* Client should be inactive.  Disable as needed */
                if (ci->has_ap) {
                        /*
                         * If here, client is active.  Leave AP.
                         * STIEG: TODO: Implement Leave AP call. We are done
                         * for now since code not implemented.
                         */
                        return;
                }

                /* Then config and reality align.  Done */
                pr_info(LOG_PFX "Client is inactive.\r\n");
                return;
        }
}


/* *** Methods that handle the Wifi AP and its actions *** */

/**
 * Callback that gets invoked when the get_ap_info command completes.
 */
static void get_ap_info_cb(const bool status,
                           const struct esp8266_ap_info* info)
{
        cmd_completed();
        cmd_set_check(CHECK_WIFI_AP);
        esp8266_state.ap.info_timestamp = getUptime();

        const size_t ap_info_size = sizeof(esp8266_state.ap.info);
        if (!status) {
                pr_warning(LOG_PFX "Failed to read AP info\r\n");
                memset(&esp8266_state.ap.info, 0, ap_info_size);
                return;
        }

        memcpy(&esp8266_state.ap.info, info, ap_info_size);

        /* Print out our AP Info here */
        pr_info(LOG_PFX "AP info:\r\n");
        pr_info_str_msg("\t SSID      : ", info->ssid);
        pr_info_int_msg("\t Channel   : ", info->channel);
        pr_info_int_msg("\t Encryption: ", info->encryption);
}

/**
 * Command that will retrieve the Soft AP configuration settings
 * from the WiFi device.
 */
static bool get_ap_info()
{
        pr_info(LOG_PFX "Retrieving Wifi AP Info\r\n");

        const bool queued = esp8266_get_ap_info(get_ap_info_cb);
        if (queued)
                cmd_started();

        return queued;
}

/**
 * Callback that is invoked when the set_ap command completes.
 */
static void set_ap_cb(const bool status)
{
        cmd_completed();
        cmd_set_check(CHECK_WIFI_AP);

        /* Update our backoff timer to prevent busy loops */
        esp8266_state.ap.next_set_attempt =
                date_time_uptime_now_plus(AP_BACKOFF_MS);

        /* Clear out the info since it has changed */
        const size_t ap_info_size = sizeof(esp8266_state.ap.info);
        memset(&esp8266_state.ap.info, 0, ap_info_size);
        esp8266_state.ap.info_timestamp = 0;

        if (!status)
                pr_warning(LOG_PFX "Failed to read AP info\r\n");
}

/**
 * Command that will set the configuration of the soft AP of the
 * esp8266 device.
 */
static bool set_ap(struct esp8266_ap_info* ap_info)
{
        pr_info(LOG_PFX "Updating Wifi AP Config.\r\n");
        const bool queued = esp8266_set_ap_info(ap_info, set_ap_cb);
        if (queued)
                cmd_started();

        return queued;
}

/**
 * Helper method to check_wifi_ap.  This method will attempt to adjust the
 * wifi ap settings if it deems that enough time has passed.  Otherwise it
 * will cause a back-off to occur.  This is necessary so that a bad config
 * doesn't cause a busy wait in the system.
 */
static void ap_check_try_set()
{
        if (!date_time_is_past(esp8266_state.ap.next_set_attempt)){
                /* Then we need to backoff */
                const tiny_millis_t sleep_len =
                        esp8266_state.ap.next_set_attempt - getUptime();
                cmd_sleep(CHECK_WIFI_AP, sleep_len);
                return;
        }

