autosportlabs/RaceCapture-Pro_firmware/src/drivers/esp8266_drv.c
        /* Setup our configuration structure to pass in */
        const struct wifi_ap_cfg* cfg = esp8266_state.ap.config;
        struct esp8266_ap_info ap_info;
        strncpy(ap_info.ssid, cfg->ssid, ARRAY_LEN(ap_info.ssid));
        strncpy(ap_info.password, cfg->password, ARRAY_LEN(ap_info.password));
        ap_info.channel = cfg->channel;
        ap_info.encryption = cfg->encryption;

        if (!set_ap(&ap_info))
                pr_warning(LOG_PFX "Failed to issue set_ap command\r\n");
}

/**
 * This is the block of logic that manages our WiFi client state.
 * Its responsible for keeping the client status as close to the
 * configuration as is reasonably possible.
 */
static void check_wifi_ap()
{
        cmd_check_complete(CHECK_WIFI_AP);
        pr_info(LOG_PFX "Checking WiFi AP\r\n");

        /* First check that we are initialized */
        if (!device_initialized()) {
                cmd_sleep(CHECK_WIFI_AP, AP_BACKOFF_MS);
                return;
        }

        /*
         * First check if we have reasonably fresh AP info. Have to
         * have it before we can make any decisions.
         */
        if (0 == esp8266_state.ap.info_timestamp) {
                get_ap_info();
                return;
        }

        /* If here, we have fresh AP info.  Use it to make decisions. */
        const struct wifi_ap_cfg* cfg = esp8266_state.ap.config;
        if (!cfg->active) {
                /*
                 * AP should be inactive. This is controlled by the device
                 * state machine because managing the esp8266
                 * device mode effects both the wifi client and the soft
                 * AP.  Hence this is a NO OP here.
                 */
                pr_info(LOG_PFX "AP is inactive.\r\n");
                return;
        }

        /* Config says AP should be active. Make it so. */
        const struct esp8266_ap_info* info = &esp8266_state.ap.info;
        if (!STR_EQ(cfg->ssid, info->ssid) ||
            !STR_EQ(cfg->password, info->password) ||
            cfg->channel != info->channel ||
            cfg->encryption != info->encryption) {
                /* Then we need to re-setup our AP */
                ap_check_try_set();
                return;
        }

        /* If here, then our AP setup is correct.  Do we have IP info? */
        if (!*esp8266_state.ap.ipv4.address) {
                /* Then we need to get IP Information */
                get_ip_info();
                return;
        }

        /* If here, we are setup properly and are done */
        pr_info(LOG_PFX "AP configured properly\r\n");
        pr_info_str_msg(LOG_PFX "Station IP: ",
                        esp8266_state.ap.ipv4.address);
        return;
}


/* *** Methods that handle the Server and its actions *** */

static void server_cmd_cb(bool status)
{
        cmd_completed();
        esp8266_state.server.listening = status;
        if (!status)
                pr_warning(LOG_PFX "Failed to setup server\r\n");
}

static void setup_server()
{
        pr_info_int_msg(LOG_PFX "Starting server on port: ",
                        RCP_SERVICE_PORT);
        esp8266_server_cmd(ESP8266_SERVER_ACTION_CREATE, RCP_SERVICE_PORT,
                           server_cmd_cb);
        cmd_started();
}

/**
 * This logic is responsible for checking the server and ensuring that it
 * is in its correct state.  If its not, then this code will get it there.
 */
static void check_server()
{
        cmd_check_complete(CHECK_SERVER);

        pr_info(LOG_PFX "Checking Server\r\n");

        /* First check that we are initialized */
        if (!device_initialized()) {
                cmd_sleep(CHECK_SERVER, CLIENT_BACKOFF_MS);
                return;
        }

        if (!esp8266_state.server.listening) {
                /* Then we need to activate it */
                setup_server();
                return;
        }

        /* Then its listening.  We are done */
        return;
}


/* *** The all important task loop *** */

static void task_loop()
{
        esp8266_do_loop(AT_TASK_TIMEOUT_MS);

        /* If there is a command in progress, no commands */
        if (!cmd_ready())
                return;

        switch(cmd_get_next_check()) {
        case CHECK_WIFI_DEVICE:
                check_wifi_device();
                break;
        case CHECK_WIFI_CLIENT:
                check_wifi_client();
                break;
        case CHECK_WIFI_AP:
                check_wifi_ap();
                break;
        case CHECK_SERVER:
                check_server();
                break;
        case CHECK_DATA:
                check_data();
                break;
        default:
                /* Nothing to do. */
                break;
        }
}

static void task(void *params)
{
        for(;;)
                task_loop();

        panic(PANIC_CAUSE_UNREACHABLE);
}

bool esp8266_drv_update_client_cfg(const struct wifi_client_cfg *cc)
{
        if (NULL == cc)
                return false;

        esp8266_state.client.config = cc;

        /* Set flags for what states need checking */
        cmd_set_check(CHECK_WIFI_DEVICE);
        cmd_set_check(CHECK_WIFI_CLIENT);

        return true;
}

const struct wifi_client_cfg* esp8266_drv_get_client_config()
{
        return esp8266_state.client.config;
}

bool esp8266_drv_update_ap_cfg(const struct wifi_ap_cfg *wac)
{
        if (NULL == wac)
                return false;

        esp8266_state.ap.config = wac;

        /* Zero this value out so we will forego any backoff attempts */
        esp8266_state.ap.next_set_attempt = 0;

        /* Set flags for what states need checking */
        cmd_set_check(CHECK_WIFI_DEVICE);
        cmd_set_check(CHECK_WIFI_AP);

        return true;
}

const struct wifi_ap_cfg* esp8266_drv_get_ap_config()
{
        return esp8266_state.ap.config;
}

static bool init_channel_sync_op(struct channel_sync_op* op)
{
        if (op->op_semaphore || op->cb_semaphore) {
                pr_error(LOG_PFX "Sync op already initialized\r\n");
                return false;
        }

        op->op_semaphore = xSemaphoreCreateBinary();
        op->cb_semaphore = xSemaphoreCreateBinary();

