autosportlabs/RaceCapture-Pro_firmware/src/drivers/esp8266_drv.c
        if (!op->op_semaphore || !op->cb_semaphore)
                return false;

        xSemaphoreGive(op->op_semaphore);
        return true;
}

bool esp8266_drv_init(struct Serial *s, const int priority,
                      new_conn_func_t new_conn_cb)
{
        /* Initialize the esp8266 hardware */
        if (!wifi_device_init()) {
            pr_error(LOG_PFX "Failed to init WiFi device\r\n");
            return false;
        }

        if (esp8266_state.device.serial)
                return false; /* Already setup */

        if (!s) {
                pr_error(LOG_PFX "NULL serial\r\n");
                return false;
        }
        esp8266_state.device.serial = s;

	/* Probe for our serial device and adjust baud. */
	esp8266_wait_for_ready(s);
	if (!esp8266_probe_device(s, WIFI_MAX_BAUD)) {
		pr_warning(LOG_PFX "Failed to probe WiFi device\r\n");
		return false;
	}

        /* Create and setup semaphores for connections */
        const bool init_sync_ops =
                init_channel_sync_op(&esp8266_state.comm.connect_op) &&
                init_channel_sync_op(&esp8266_state.comm.close_op);
        if (!init_sync_ops) {
                pr_error(LOG_PFX "Failed to initialize sync op structs\r\n");
                return false;
        }

        /* Initialize our WiFi configs here */
        LoggerConfig *lc = getWorkingLoggerConfig();
        const struct wifi_client_cfg *cfg =
                &lc->ConnectivityConfigs.wifi.client;
        if (!esp8266_drv_update_client_cfg(cfg)) {
                pr_error(LOG_PFX "Failed to set WiFi client cfg\r\n");
                return false;
        }

        const struct wifi_ap_cfg* wac =
                &lc->ConnectivityConfigs.wifi.ap;
        esp8266_drv_update_ap_cfg(wac);

	/* Initialize the esp8266 AT subsystem here */
	if (!esp8266_setup(esp8266_state.device.serial, SERIAL_CMD_MAX_LEN)) {
		pr_warning(LOG_PFX "Failed to setup WiFi AT subsys\r\n");
		return false;
	}

	/* Setup callback for new connections */
	esp8266_state.comm.new_conn_cb = new_conn_cb;

	/* Set the task loop to check the wifi_device first */
        cmd_set_check(CHECK_WIFI_DEVICE);

        static const signed char task_name[] = TASK_THREAD_NAME;
        const size_t stack_size = TASK_STACK_SIZE;
        xTaskCreate(task, task_name, stack_size, NULL, priority, NULL);

        const signed char* timer_name = (signed char*) "Wifi LED Timer";
        const size_t period = msToTicks(LED_PERIOD_MS);
        esp8266_state.led.timer = xTimerCreate(timer_name, period, false,
                                               NULL, led_timer_cb);

        return !!esp8266_state.led.timer;
}

/**
 * Callback method invoked when a callback completes.
 */
static void connect_cb(const bool status, const bool already_connected)
{
        struct channel_sync_op *cso = &esp8266_state.comm.connect_op;
        struct channel *ch = esp8266_state.comm.channels + cso->chan_id;

        if (already_connected) {
		pr_info_int_msg(LOG_PFX "State mismatch. Channel already "
				"connected: ", cso->chan_id);
                channel_close(ch);
        } else if (!status) {
		pr_info_int_msg(LOG_PFX "Failed to connect channel: ",
				cso->chan_id);
		channel_close(ch);
	}

        cmd_set_check(CHECK_DATA);
        xSemaphoreGive(cso->cb_semaphore);
}

/**
 * Synchronous command used to open a new connection to a given destinataion
 * @param proto The protocol to use.
 * @param addr The destination address (either IP or DNS name).
 * @param port The destination port to connect to.
 * @param rx_size The size of the Rx buffer. 0 will yeild the default value.
 * @param tx_size The size of the Tx buffer. 0 will yeild the default value.
 * @return A valid Serial object if a connection was made, NULL otherwise.
 */
struct Serial* esp8266_drv_connect(const enum protocol proto,
                                   const char* addr,
                                   const unsigned int port,
				   const size_t rx_size,
				   const size_t tx_size)
{
        /* This is synchronous code for now */
        struct channel_sync_op *cso = &esp8266_state.comm.connect_op;
        xSemaphoreTake(cso->op_semaphore, portMAX_DELAY);

        struct Serial* serial = NULL;
        cso->chan_id = channel_get_next_available();
        if (cso->chan_id < 0) {
                pr_warning(LOG_PFX "Failed to acquire a free channel\r\n");
                goto done;
        }

        struct channel *ch = channel_setup(cso->chan_id, rx_size, tx_size);
        if (NULL == ch) {
                pr_warning(LOG_PFX "Can't allocate resources for channel\r\n");
                goto done;
        }

        bool connect_result = false;
        switch(proto) {
        case PROTOCOL_TCP:
                connect_result = esp8266_connect_tcp(cso->chan_id, addr,
                                                     port, -1, connect_cb);
                break;
        case PROTOCOL_UDP:
                ;
                int src_port = 0;
                enum esp8266_udp_mode udp_mode = ESP8266_UDP_MODE_NONE;
                if (0 == strcmp(addr, IPV4_BROADCAST_ADDRESS_STR)) {
                        src_port = port;
                        udp_mode = ESP8266_UDP_MODE_PEER_CHANGE_WHENEVER;
                }
                connect_result = esp8266_connect_udp(cso->chan_id, addr,
                                                     port, src_port,
                                                     udp_mode, connect_cb);
                break;
        }
        if (!connect_result) {
                pr_warning(LOG_PFX "Failed to issue connect command\r\n");
                goto done;
        }

        /* Now wait for our callback to come */
        if (!xSemaphoreTake(cso->cb_semaphore, portMAX_DELAY)) {
                pr_warning(LOG_PFX "Timed out waiting for connect "
                           "response\r\n");
                goto done;
        }

	/* If unsuccessful, the callback will close the channel */
        if (!channel_is_open(ch)) {
                pr_info_str_msg(LOG_PFX "Failed to connect: ", addr);
		serial_destroy(serial);
		serial = NULL;
                goto done;
        }

        serial = ch->serial;
        pr_info_int_msg(LOG_PFX "Connected on comm channel ", cso->chan_id);

done:
        xSemaphoreGive(cso->op_semaphore);
        return serial;
}

/**
 * Callback invoked when the close command completes.
 */
static void close_cb(const bool status)
{
        struct channel_sync_op *cso = &esp8266_state.comm.close_op;
        cmd_set_check(CHECK_DATA);

	if (!status)
		pr_warning_int_msg(LOG_PFX "Failed to close channel ",
				   (int) cso->chan_id);

