autosportlabs/RaceCapture-Pro_firmware/src/drivers/esp8266_drv.c
        xSemaphoreGive(cso->cb_semaphore);
}

/**
 * Closes an open connection given the Serial object returned by
 * esp8266_drv_connect
 * @param serial Serial object returned by esp8266_drv_connect
 * @return True if the operation was successful, false otherwise.
 */
bool esp8266_drv_close(struct Serial* serial)
{
        /* This is synchronous code for now */
        struct channel_sync_op *cso = &esp8266_state.comm.close_op;
        xSemaphoreTake(cso->op_semaphore, portMAX_DELAY);
        bool status = false;

        cso->chan_id = channel_find_serial(serial);
        if (cso->chan_id < 0) {
                pr_warning(LOG_PFX "Unable to find channel with associated "
                           "serial device.\r\n");
                goto done;
        }

        struct channel *ch = esp8266_state.comm.channels + cso->chan_id;
        if (channel_is_open(ch)) {
		struct Serial* s = ch->serial;
		channel_close(ch);
		serial_destroy(s);
	}

        if (!esp8266_close(cso->chan_id, close_cb)) {
                pr_warning(LOG_PFX "Failed to issue close command\r\n");
                goto done;
        }

        /* Now wait for our callback to come */
        if (!xSemaphoreTake(cso->cb_semaphore, portMAX_DELAY)) {
                pr_warning(LOG_PFX "Timed out waiting for close "
                           "response\r\n");
                goto done;
        }

done:
        xSemaphoreGive(cso->op_semaphore);
        return status;
}

const struct esp8266_ipv4_info* get_client_ipv4_info()
{
        return &esp8266_state.client.ipv4;
}

const struct esp8266_ipv4_info* get_ap_ipv4_info()
{
        return &esp8266_state.ap.ipv4;
}

/**
 * Tells us if the WiFi client is connected to the correct WiFi network.
 * @return true if it is, false otherwise.
 */
bool esp8266_drv_client_connected()
{
        const struct wifi_client_cfg *cfg = esp8266_state.client.config;
        const struct esp8266_client_info *ci = &esp8266_state.client.info;
        return cfg && ci->has_ap && STR_EQ(ci->ssid, cfg->ssid);
}
